STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_pwr.c
#define ADCx_CHANNEL_GPIO_CLK_ENABLE(__ADC_CHANNEL__) \
                                            do {  if ((__ADC_CHANNEL__) == ADCx_CHANNEL_VSENSE_1) {ADCx_CHANNEL_VSENSE_1_GPIO_CLK_ENABLE();} else \
                                                  if ((__ADC_CHANNEL__) == ADCx_CHANNEL_ISENSE_1) {ADCx_CHANNEL_ISENSE_1_GPIO_CLK_ENABLE();} else \
                                                  if ((__ADC_CHANNEL__) == ADCx_CHANNEL_VSENSE_2) {ADCx_CHANNEL_VSENSE_2_GPIO_CLK_ENABLE();} else \
                                                  if ((__ADC_CHANNEL__) == ADCx_CHANNEL_ISENSE_2) {ADCx_CHANNEL_VSENSE_2_GPIO_CLK_ENABLE();} else \
                                                  if ((__ADC_CHANNEL__) == ADCx_CHANNEL_VSENSE_DCDC) {ADCx_CHANNEL_VSENSE_DCDC_GPIO_CLK_ENABLE();}} while(0u)

#define ABS(__VAL__) (((int32_t)(__VAL__)) < 0 ? - ((int32_t)(__VAL__)) : ((int32_t)(__VAL__)))

#if defined(PWR_DEBUG)
#define __PWR_DEBUG_CALLBACK(_PORT_, __MESSAGE__) USBPD_TRACE_Add(USBPD_TRACE_POWER, (_PORT_), 0u,(uint8_t*)(__MESSAGE__), sizeof(__MESSAGE__) - 1u)
#else
#define __PWR_DEBUG_CALLBACK(_PORT_, __MESSAGE__)
#endif /* PWR_DEBUG */

/* USER CODE END POWER_Private_Macros */
/**
  * @}
  */

/** @defgroup STM32G0C1E_EVAL_POWER_Private_Variables Private Variables
  * @{
  */
/* USER CODE BEGIN POWER_Private_Variables */
/**
* @brief GPIO variables
*/
/* GPIO Id. / GPIO port cross table */
static GPIO_TypeDef *GPIO_PORT[] =
{
    GPIO_SOURCE_EN_PORT,
    GPIO_VBUS_DISCHARGE1_PORT,
    GPIO_VBUS_DISCHARGE2_PORT,
    GPIO_VCONN_EN1_PORT,
    GPIO_VCONN_EN2_PORT,
    GPIO_VCONN_DISCHARGE1_PORT,
    GPIO_VCONN_DISCHARGE2_PORT,
    GPIO_V_CTL1_PORT,
    GPIO_V_CTL2_PORT
};

/* GPIO Id. / GPIO pin cross table */
static const uint16_t GPIO_PIN[] =
{
    GPIO_SOURCE_EN_PIN,
    GPIO_VBUS_DISCHARGE1_PIN,
    GPIO_VBUS_DISCHARGE2_PIN,
    GPIO_VCONN_EN1_PIN,
    GPIO_VCONN_EN2_PIN,
    GPIO_VCONN_DISCHARGE1_PIN,
    GPIO_VCONN_DISCHARGE2_PIN,
    GPIO_V_CTL1_PIN,
    GPIO_V_CTL2_PIN
};

/* ADC Channel / GPIO port cross table */
static GPIO_TypeDef *  ADC_CHANNEL_PORT[ADCxChanneln] =
{
    ADCx_CHANNEL_VSENSE_1_GPIO_PORT,
    ADCx_CHANNEL_ISENSE_1_GPIO_PORT,
    ADCx_CHANNEL_VSENSE_2_GPIO_PORT,
    ADCx_CHANNEL_ISENSE_2_GPIO_PORT,
    ADCx_CHANNEL_VSENSE_DCDC_GPIO_PORT
};

/* ADC Channel / GPIO pin cross table */
static const uint32_t ADC_CHANNEL_PIN[ADCxChanneln] =
{
    ADCx_CHANNEL_VSENSE_1_GPIO_PIN,
    ADCx_CHANNEL_ISENSE_1_GPIO_PIN,
    ADCx_CHANNEL_VSENSE_2_GPIO_PIN,
    ADCx_CHANNEL_ISENSE_2_GPIO_PIN,
    ADCx_CHANNEL_VSENSE_DCDC_GPIO_PIN
};

/* Variable containing ADC conversions results
   aADCxConvertedValues[0u]: VSENSE_2
   aADCxConvertedValues[1u]: VSENSE_1
   aADCxConvertedValues[2u]: ISENSE_1
   aADCxConvertedValues[3u]: ISENSE_2
*/
static __IO uint16_t   aADCxConvertedValues[4] = {0};

/* BSP PWR contextual data */
static ContextTypeDef Context =
{
  .ADCRefCount         = 0u,
    .DCDCCtrlMode        = DCDC_CTRL_MODE_UNKNOWN,
    .PortInfo =
    {
        /* USBPD_PWR_TYPE_C_PORT_1 */
        {
            .State                      = PORT_NOT_INITIALIZED,
            .Role                       = POWER_ROLE_SOURCE,
            .VBUSDisconnectionThreshold = VBUS_DISCONNECTION_THRESHOLD,
            .VBUSConnectionStatus       = VBUS_NOT_CONNECTED,
            .pfnVBUSDetectCallback      = NULL,
            .VBUSVoltage                = 0u,
        },
        /* USBPD_PWR_TYPE_C_PORT_2 */
        {
            .State                      = PORT_NOT_INITIALIZED,
            .Role                       = POWER_ROLE_SINK,
            .VBUSDisconnectionThreshold = VBUS_DISCONNECTION_THRESHOLD,
            .VBUSConnectionStatus       = VBUS_NOT_CONNECTED,
            .pfnVBUSDetectCallback      = NULL,
            .VBUSVoltage                = 0u,
        }
    }
};

/* VBUS sensing completed flag */
static uint8_t VBUSSensingCompleted = 0u;

/* Power source calibration related variables */
static uint16_t aPWMDutyCycleLUT[VBUS_LEVEL_NB] =
{
  0x00B0,   /* 5V */
  0x0200,   /* 9V */
  0x0300,   /* 15V */
  0x0400,   /* 18V */
  0x0000    /* Will be used to store latest PPS request */
};

/* LPTIM handle */
static LPTIM_HandleTypeDef hlptim  = {0u};

#if defined(DBG_LOG)
#define DBG_LOG_SIZE 10
uint8_t _DbgLogIndex = 0;

uint32_t _vbusout[DBG_LOG_SIZE];
int32_t  _Err[DBG_LOG_SIZE];
uint32_t _Pwm[DBG_LOG_SIZE];
int32_t  _PwmE[DBG_LOG_SIZE];
#endif /* DBG_LOG */

/* USER CODE END POWER_Private_Variables */
/**
  * @}
  */

/** @defgroup STM32G0C1E_EVAL_POWER_Private_Functions Private Functions
  * @{
  */
/* USER CODE BEGIN POWER_Private_Prototypes */
static uint8_t  PWR_InitSource(uint32_t Instance);
static uint8_t  PWR_DeInitSource(uint32_t Instance);
static uint8_t  PWR_InitSink(void);
static uint8_t  PWR_DeInitSink(void);
static void     PWR_GPIO_Init(GPIO_Id_TypeDef gpio);
static void     PWR_GPIO_DeInit(GPIO_Id_TypeDef gpio);
static void     PWR_GPIO_On(GPIO_Id_TypeDef gpio);
static void     PWR_GPIO_Off(GPIO_Id_TypeDef gpio);
static void     LPTIMx_MspInit(void);
static void     LPTIMx_MspDeInit(void);
static void     PWR_ADC_MspInit(ADC_HandleTypeDef *hadc);
static void     PWR_ADC_MspDeInit(ADC_HandleTypeDef *hadc);
static void     PWR_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc);
static uint8_t  PWR_ADC_SetConfig(void);
static void     PWR_ADC_ResetConfig(void);
static uint8_t  PWR_ADC_SetChannelConfig(ADC_ChannelId_TypeDef ADCChannel);
static void     PWR_ADC_ResetChannelConfig(ADC_ChannelId_TypeDef ADCChannel);
static uint32_t PWR_ConvertADCDataToVoltage(uint32_t ADCData);
static uint32_t PWR_ConvertVoltageToThreshold(uint32_t PWR_ConvertVoltageToThreshold);
static int32_t  PWR_ConvertADCDataToCurrent(uint32_t ADCData);
static uint8_t  PWR_StartVBusSensing(void);
static uint8_t  PWR_StopVBusSensing(void);
static uint8_t  PWR_PauseVBusSensing(void);
static uint8_t  PWR_ResumeVBusSensing(void);
static uint8_t  PWR_InitPowerSource(void);
static void     PWR_DeInitPowerSource(void);
static void     PWR_SetPWMDutyCycle(uint16_t PWMDutyCycle);
static uint16_t PWR_GetPWMDutyCycle(void);

