STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_pwr.c
static void     PWR_DCDCPreChargeC57(uint32_t Instance);

static void     PWR_VBUSDischarge(uint32_t Instance,
                           uint32_t VbusStopInmV,
                           uint32_t VbusErrorInmV,
                           uint16_t Delay);

static int32_t  PWR_VBUSSetVoltage(uint32_t Instance,
                                         uint32_t VBusInmV,
                                         uint16_t Precision);

/* USER CODE END POWER_Private_Prototypes */
/**
  * @}
  */

/** @defgroup STM32G0C1E_EVAL_POWER_Imported_Variables Imported Variables
  * @{
  */
extern ADC_HandleTypeDef hadc1;
extern DMA_HandleTypeDef hdma_adc1;
/**
  * @}
  */

/** @addtogroup STM32G0C1E_EVAL_POWER_Exported_Functions
  * @{
  */
/**
  * @brief  Get the VSENSE_DCDC measurement with  DCDC_EN = 0 and = 1
  *         controller.
  * @param  voltageDCDCOff voltage DCDC Off.
  * @param  voltageDCDCOnT0  voltage DCDC Off at T0.
  * @param  voltageDCDCOnT10  voltage DCDC Off at T10 = 100ms.
  * @retval none
  */
void BSP_PWR_VBUSIsGPIO(uint32_t *voltageDCDCOff, uint32_t *voltageDCDCOnT0, uint32_t *voltageDCDCOnT10)
{
  uint8_t                  error = 0;
  GPIO_InitTypeDef         gpio_config = {0};
  ADC_HandleTypeDef        hadc = {0};
  ADC_ChannelConfTypeDef   adc_channel_config = {0};
  GPIO_InitTypeDef         GPIO_InitStruct;

  *voltageDCDCOff = *voltageDCDCOnT0 = *voltageDCDCOnT10 = 0;

  /* Enable GPIO clock */
  DB_DETECT_GPIO_CLK_ENABLE();

  /* Configure GPIO pin of the selected ADC channel */
  gpio_config.Pin = DB_DETECT_PIN;
  gpio_config.Mode = GPIO_MODE_ANALOG;
  gpio_config.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(DB_DETECT_GPIO_PORT, &gpio_config);

  /* Enable ADC clock */
  DB_ADC_CLK_ENABLE();

  /* Register ADC MSP callback functions */
  if ((HAL_ADC_RegisterCallback(&hadc, HAL_ADC_MSPINIT_CB_ID, PWR_ADC_MspInit) != HAL_OK)
   || (HAL_ADC_RegisterCallback(&hadc, HAL_ADC_MSPDEINIT_CB_ID, PWR_ADC_MspDeInit) != HAL_OK))
  {
    /* Callback function registration Error */
    error++;
  }

  /* Initialize ADC */
  hadc.Instance = DB_ADC;

  if (HAL_ADC_DeInit(&hadc) != HAL_OK)
  {
    /* ADC de-initialization Error */
    error++;
  }


  hadc.Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV4;
  hadc.Init.Resolution            = ADC_RESOLUTION_12B;
  hadc.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
  hadc.Init.ScanConvMode          = ADC_SCAN_DIRECTION_FORWARD;
  hadc.Init.EOCSelection          = ADC_EOC_SINGLE_CONV;
  hadc.Init.LowPowerAutoWait      = DISABLE;
  hadc.Init.LowPowerAutoPowerOff  = DISABLE;
  hadc.Init.ContinuousConvMode    = ENABLE;
  hadc.Init.DiscontinuousConvMode = DISABLE;
  hadc.Init.ExternalTrigConv      = ADC_SOFTWARE_START;
  hadc.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc.Init.DMAContinuousRequests = DISABLE;
  hadc.Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;
  hadc.Init.SamplingTimeCommon1   = ADC_SAMPLETIME_39CYCLES_5;
  hadc.Init.OversamplingMode      = DISABLE;

  if (HAL_ADC_Init(&hadc) != HAL_OK)
  {
    error++;
  }

  /* Register ADC conversion complete callback function */
  if (HAL_ADC_RegisterCallback(&hadc, HAL_ADC_CONVERSION_COMPLETE_CB_ID, PWR_ADC_ConvCpltCallback) != HAL_OK)
  {
    /* Callback function registration Error */
    error++;
  }

  /* Run the ADC calibration */
  if (HAL_ADCEx_Calibration_Start(&hadc) != HAL_OK)
  {
    error++;
  }

  /* Configure the ADC channel used to identify the daughter board */
  adc_channel_config.Channel      = DB_ADC_CHANNEL;
  adc_channel_config.Rank         = ADC_RANK_CHANNEL_NUMBER;
  adc_channel_config.SamplingTime = ADC_SAMPLINGTIME_COMMON_1;

  if (HAL_ADC_ConfigChannel(&hadc, &adc_channel_config) != HAL_OK)
  {
    error++;
  }

  /* Initialise DCDC_EN = 0 */
  GPIO_V_CTL2_CLK_ENABLE();
  HAL_GPIO_DeInit(GPIO_PORT[GPIO_V_CTL2],GPIO_PIN[GPIO_V_CTL2]);
  GPIO_InitStruct.Pin   = GPIO_PIN[GPIO_V_CTL2];
  GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_OD;
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIO_PORT[GPIO_V_CTL2], &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIO_PORT[GPIO_V_CTL2], GPIO_PIN[GPIO_V_CTL2], GPIO_PIN_RESET);

  /* Start conversion */
  if (HAL_ADC_Start(&hadc) != HAL_OK)
  {
    error++;
  }

  /* Wait for conversion completion */
  if (HAL_ADC_PollForConversion(&hadc, 10) != HAL_OK)
  {
    error++;
  }

  /* Translate ADC conversion into voltage level */
  *voltageDCDCOff = __HAL_ADC_CALC_DATA_TO_VOLTAGE(VREFANALOG_VOLTAGE,
                                             HAL_ADC_GetValue(&hadc),
                                             hadc.Init.Resolution);
  /* stop conversion */
  if (HAL_ADC_Stop(&hadc) != HAL_OK)
  {
    error++;
  }

  /* Initialise DCDC_EN = 1 */
  HAL_GPIO_DeInit(GPIO_PORT[GPIO_V_CTL2], GPIO_PIN[GPIO_V_CTL2]);
  GPIO_InitStruct.Pin   = GPIO_PIN[GPIO_V_CTL2];
  GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIO_PORT[GPIO_V_CTL2], &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIO_PORT[GPIO_V_CTL2], GPIO_PIN[GPIO_V_CTL2], GPIO_PIN_SET);

  HAL_GPIO_DeInit(GPIO_PORT[GPIO_V_CTL1], GPIO_PIN[GPIO_V_CTL1]);
  GPIO_InitStruct.Pin   = GPIO_PIN[GPIO_V_CTL1];
  GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIO_PORT[GPIO_V_CTL1], &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIO_PORT[GPIO_V_CTL1], GPIO_PIN[GPIO_V_CTL1], GPIO_PIN_RESET);

  /* Start conversion */
  if (HAL_ADC_Start(&hadc) != HAL_OK)
  {
    error++;
  }

  /* Wait for conversion completion */
  if (HAL_ADC_PollForConversion(&hadc, 10) != HAL_OK)
  {
    error++;
  }

  /* Translate ADC conversion into voltage level */
  *voltageDCDCOnT0 = __HAL_ADC_CALC_DATA_TO_VOLTAGE(VREFANALOG_VOLTAGE,
                                             HAL_ADC_GetValue(&hadc),
                                             hadc.Init.Resolution);

  /* Start conversion */
  if (HAL_ADC_Stop(&hadc) != HAL_OK)
  {
    error++;
  }

