STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_pwr.c
      if ((Context.PortInfo[Instance].Role == POWER_ROLE_SINK) ||
          (Context.PortInfo[Instance].Role == POWER_ROLE_DUAL))
      {
        if (Context.ADCRefCount == 1u)
        {
          if (0u != PWR_StopVBusSensing())
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
        }
        if (BSP_ERROR_NONE == ret)
        {
          if (0u != PWR_DeInitSink())
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
        }
      }

      /* Update PWR context */
      Context.PortInfo[Instance].State = PORT_NOT_INITIALIZED;
    }
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VBUSDeInit */
}

/**
  * @brief  Enable power supply over VBUS.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VBUSOn(uint32_t Instance)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSOn */
  /* Check if instance is valid       */
  int32_t ret;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      /* Start VBUS Discharge */
      PWR_GPIO_On(GPIO_VBUS_DISCHARGE1);

      /* safety control to avoid spike when enabling the power */
      /* issue detected during board reset */
      uint32_t _tickstart = HAL_GetTick();
      uint32_t _dcdc;
      uint32_t _delta = BSP_PWR_DCDCGetVoltage(Instance);

      do
      {
        _dcdc = BSP_PWR_DCDCGetVoltage(Instance);

        /* check after 2 second check if the power has start to decrease */
        if ((((HAL_GetTick() - _tickstart) > 2000u)) && ((_delta - _dcdc) < 500u))
        {
#if defined(_TRACE)
          uint8_t _str[20];
          sprintf((char *)_str,"V:%ld-%ld", _dcdc, _delta);
          USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, _str, strlen((char *)_str));
          USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t *) "V:decrease error", 16);
#endif
          return BSP_ERROR_PERIPH_FAILURE;
        }

        /* Timeout management */
        if ((HAL_GetTick() - _tickstart) > 15000u)
        {
#if defined(_TRACE)
          USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t *) "V:timeout", 9);
#endif
          return BSP_ERROR_PERIPH_FAILURE;
        }
      }
      while (_dcdc > 5500u);

      /* Switch on VBUS */
      PWR_GPIO_On(GPIO_SOURCE_EN);

      /* Set VBUS to its default voltage level */
      ret = PWR_VBUSSetVoltage(Instance, VBUS_VOLTAGE_5V_IN_MV, 80u); /* 5% max = 250mV max */

      /* Stop VBUS Discharge */
      PWR_GPIO_Off(GPIO_VBUS_DISCHARGE1);
    }
    else
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }

    /* Save the power context */
    Context.PortInfo[Instance].VBUSVoltage = VBUS_VOLTAGE_5V_IN_MV;
    Context.PortInfo[Instance].Type = POWER_FIXED;

  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VBUSOn */
}

int32_t BSP_USBPD_PWR_FRSVBUSEnable(uint32_t Instance)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSOff */

  /* Wait for VBUS to get under VSAFE5V */
  uint32_t count = 500U * (SystemCoreClock / 650U / 1000U); /* Rough 500ms timeout, depends on instructions in
                                                                the loop, optimization and cache */
  do
  {
    count--;
    if (count == 0U)
    {
      __PWR_DEBUG_CALLBACK(Instance, "Timeout: FRS detected, but VBUS never dropped under vSafe5V");

      /* Discard the VBUS enabling and return an error */
      return BSP_ERROR_PERIPH_FAILURE;
    }
  }
  while (BSP_PWR_VBUSGetVoltage(Instance) > 4750u);

  /* Switch on VBUS */
  PWR_GPIO_On(GPIO_SOURCE_EN);

  /* Set VBUS to its default voltage level */
  PWR_VBUSSetVoltage(Instance, VBUS_VOLTAGE_5V_IN_MV, 80u); /* 5% max = 250mV max */

  return BSP_ERROR_NONE;
  /* USER CODE END BSP_USBPD_PWR_VBUSOff */
}

/**
  * @brief  Disable power supply over VBUS.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VBUSOff(uint32_t Instance)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSOff */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      /* Go back to original VBUS value */
      ret = PWR_VBUSSetVoltage(0u, VBUS_VOLTAGE_0V_IN_MV, 0u);

      /* Discharge VBUS */
      PWR_VBUSDischarge(Instance, USBPD_PWR_LOW_VBUS_THRESHOLD, 0u, 0u);
    }

    /* Save the power context */
    Context.PortInfo[Instance].VBUSVoltage = VBUS_VOLTAGE_0V_IN_MV;
    Context.PortInfo[Instance].Type = POWER_NONE;
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_VBUSOff */
}

/**
  * @brief  Set a fixed/variable PDO and manage the power control.
  * @param  Instance Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
  * @param  VbusTargetInmv the vbus Target (in mV)
  * @param  OperatingCurrent the Operating Current (in mA)
  * @param  MaxOperatingCurrent the Max Operating Current (in mA)
  * @retval BSP status
  */
int32_t BSP_USBPD_PWR_VBUSSetVoltage_Fixed(uint32_t Instance,
                                           uint32_t VbusTargetInmv,
                                           uint32_t OperatingCurrent,
                                           uint32_t MaxOperatingCurrent)
{
  /* USER CODE BEGIN BSP_USBPD_PWR_VBUSSetVoltage_Fixed */
  /* Check if instance is valid       */
  int32_t ret = BSP_ERROR_NONE;
  UNUSED(MaxOperatingCurrent);
  UNUSED(OperatingCurrent);

  if (Instance >= USBPD_PWR_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (Context.PortInfo[Instance].VBUSVoltage != VbusTargetInmv)
    {
      /* Start VBUS Discharge, done to increase the decrease speed */
      PWR_GPIO_On(GPIO_VBUS_DISCHARGE1);

