STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_pwr.c
  if ((Instance >= USBPD_PWR_INSTANCES_NBR) || (NULL == pDCDCCtrl))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (Instance == USBPD_PWR_TYPE_C_PORT_1)
    {
      *pDCDCCtrl = Context.DCDCCtrlMode;
    }
  }
  return ret;
  /* USER CODE END BSP_USBPD_PWR_DCDCGetCtrlMode */
}

/**
  * @}
  */

/** @addtogroup STM32G0C1E_EVAL_POWER_Private_Functions
  * @{
  */

/* USER CODE BEGIN POWER_Private_Functions */
/**
 * @brief  Initialize the hardware resources used by a port acting as a source.
 * @param  Instance Type-C port identifier
 *         This parameter can be take one of the following values:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
* @retval 0 success else fail
 */
static uint8_t PWR_InitSource(uint32_t Instance)
{
  uint8_t ret;

  if (Instance == USBPD_PWR_TYPE_C_PORT_1)
  {
    /* Initialize the Type-C port 1 related GPIOs */
    PWR_GPIO_Init(GPIO_VBUS_DISCHARGE1);
    PWR_GPIO_Init(GPIO_SOURCE_EN);
    ret = PWR_InitPowerSource();
    PWR_GPIO_Init(GPIO_V_CTL2);

    if (ret == 0u)
    {
      /* Pre-charge C57 to avoid a high voltage overshoot on VSOURCE when DCDC is enabled. */
      PWR_DCDCPreChargeC57(USBPD_PWR_TYPE_C_PORT_1);

      /* Determine DCDC voltage control mode (GPIO or PWM) */
      Context.DCDCCtrlMode = DCDC_CTRL_MODE_PWM;
    }
    return ret;
  }
  else
  {
    return 1u;
  }
}

/**
 * @brief  Release the hardware resources used by a port acting as a source.
 * @param  Instance Type-C port identifier
 *         This parameter can take following value:
 *         @arg @ref USBPD_PWR_TYPE_C_PORT_1
* @retval 0 success else fail
 */
static uint8_t PWR_DeInitSource(uint32_t Instance)
{
  if (Instance == USBPD_PWR_TYPE_C_PORT_1)
  {
    /* De-initialize the Type-C port 1 related GPIOs */
    PWR_DeInitPowerSource();
    PWR_GPIO_DeInit(GPIO_V_CTL2);
    PWR_GPIO_DeInit(GPIO_SOURCE_EN);
    PWR_GPIO_DeInit(GPIO_VBUS_DISCHARGE1);

    return 0;
  }
  else
  {
    return 1u;
  }
}

/**
 * @brief  Initialize the hardware resources used by a port acting as a sink.
 * @retval 0 success else fail
 */
static uint8_t PWR_InitSink(void)
{
  uint8_t ret = 0u;

  ret += PWR_ADC_SetConfig();

  Context.ADCRefCount++;

  return ret;
}

/**
 * @brief  Release the hardware resources used by a port acting as a sink.
* @retval 0 success else fail
 */
static uint8_t PWR_DeInitSink(void)
{
  uint8_t ret = 0u;

  Context.ADCRefCount--;

  PWR_ADC_ResetConfig();

  return ret;
}


/**
* @brief  Configures GPIO.
* @param  gpio Specifies the GPIO Pin to be configured.
*   This parameter can be one of following parameters:
*     @arg @ref   GPIO_SOURCE_EN
*     @arg @ref   GPIO_VBUS_DISCHARGE1
*     @arg @ref   GPIO_VBUS_DISCHARGE2
*     @arg @ref   GPIO_VCONN_EN1
*     @arg @ref   GPIO_VCONN_EN2
*     @arg @ref   GPIO_VCONN_DISCHARGE1
*     @arg @ref   GPIO_VCONN_DISCHARGE2
*     @arg @ref   GPIO_V_CTL2
*     @arg @ref   GPIO_V_CTL1
* @retval None
*/
static void PWR_GPIO_Init(GPIO_Id_TypeDef gpio)
{
  GPIO_InitTypeDef  GPIO_InitStruct;

  /* Enable the GPIO clock */
  GPIOx_CLK_ENABLE(gpio);

  /* Configure the GPIO pin */
  switch (gpio)
  {
  case GPIO_SOURCE_EN:
  case GPIO_VBUS_DISCHARGE1:
  case GPIO_VBUS_DISCHARGE2:
    GPIO_InitStruct.Pin   = GPIO_PIN[gpio];
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_PULLDOWN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

    HAL_GPIO_Init(GPIO_PORT[gpio], &GPIO_InitStruct);

    /* Set GPIO to inactive state */
    HAL_GPIO_WritePin(GPIO_PORT[gpio], GPIO_PIN[gpio], GPIO_PIN_RESET);
    break;

  case GPIO_VCONN_EN1:
  case GPIO_VCONN_EN2:
  case GPIO_V_CTL2:
  case GPIO_V_CTL1:
    GPIO_InitStruct.Pin   = GPIO_PIN[gpio];
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_OD;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

    HAL_GPIO_Init(GPIO_PORT[gpio], &GPIO_InitStruct);

    if(gpio == GPIO_V_CTL2)
    {
      /* Disable DCDC */
      HAL_GPIO_WritePin(GPIO_PORT[gpio], GPIO_PIN[gpio], GPIO_PIN_RESET);
    }
    else
    {
      /* Set GPIO to inactive state (High level is HI-Z) */
      HAL_GPIO_WritePin(GPIO_PORT[gpio], GPIO_PIN[gpio], GPIO_PIN_SET);
    }
    break;

  case GPIO_VCONN_DISCHARGE1:
  case GPIO_VCONN_DISCHARGE2:
    GPIO_InitStruct.Pin   = GPIO_PIN[gpio];
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

    HAL_GPIO_Init(GPIO_PORT[gpio], &GPIO_InitStruct);

    /* Set GPIO to inactive state */
    HAL_GPIO_WritePin(GPIO_PORT[gpio], GPIO_PIN[gpio], GPIO_PIN_RESET);
    break;
  default:
    break;
  }
}

/**
  * @brief  Reset  GPIO configuration.
  * @param  gpio Specifies the GPIO Pin .
  *   This parameter can be one of following parameters:
  *     @arg @ref   GPIO_SOURCE_EN
  *     @arg @ref   GPIO_VBUS_DISCHARGE1
  *     @arg @ref   GPIO_VBUS_DISCHARGE2
  *     @arg @ref   GPIO_VCONN_EN1
  *     @arg @ref   GPIO_VCONN_EN2
  *     @arg @ref   GPIO_VCONN_DISCHARGE1
  *     @arg @ref   GPIO_VCONN_DISCHARGE2
  *     @arg @ref   GPIO_V_CTL2
  *     @arg @ref   GPIO_V_CTL1
  * @retval None
  */
static void PWR_GPIO_DeInit(GPIO_Id_TypeDef gpio)
{
  HAL_GPIO_DeInit(GPIO_PORT[gpio], GPIO_PIN[gpio]);
}

/**
* @brief  Turns selected GPIO On.
* @param  gpio Specifies the GPIO Pin to be configured.
*   This parameter can be one of following parameters:
*     @arg @ref   GPIO_SOURCE_EN
*     @arg @ref   GPIO_VBUS_DISCHARGE1
*     @arg @ref   GPIO_VBUS_DISCHARGE2
*     @arg @ref   GPIO_VCONN_EN1
*     @arg @ref   GPIO_VCONN_EN2
*     @arg @ref   GPIO_VCONN_DISCHARGE1
*     @arg @ref   GPIO_VCONN_DISCHARGE2
*     @arg @ref   GPIO_V_CTL2
*     @arg @ref   GPIO_V_CTL1
* @retval None
*/
static void PWR_GPIO_On(GPIO_Id_TypeDef gpio)
{
  /* Update GPIO pin state */
  if ((gpio == GPIO_VCONN_EN1)   ||
      (gpio == GPIO_VCONN_EN2)   ||
      (gpio == GPIO_V_CTL1) ||
      (gpio == GPIO_V_CTL2))
{
    if (gpio == GPIO_V_CTL2)
    {
      GPIO_InitTypeDef  GPIO_InitStruct;

      PWR_GPIO_DeInit(GPIO_V_CTL2);

      GPIO_InitStruct.Pin   = GPIO_PIN[gpio];
      GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
      GPIO_InitStruct.Pull  = GPIO_NOPULL;
      GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
      HAL_GPIO_Init(GPIO_PORT[gpio], &GPIO_InitStruct);
      HAL_GPIO_WritePin(GPIO_PORT[gpio], GPIO_PIN[gpio], GPIO_PIN_SET);
    }
    else
  {
    /* In open-drain mode only the low level is driven (high level is HI-Z) */
      HAL_GPIO_WritePin(GPIO_PORT[gpio], GPIO_PIN[gpio], GPIO_PIN_RESET);
    }
  }
  else
  {
    HAL_GPIO_WritePin(GPIO_PORT[gpio], GPIO_PIN[gpio], GPIO_PIN_SET);
  }
}

/**
* @brief  Turns selected GPIO Off.
* @param  gpio Specifies the GPIO Pin to be configured.
*   This parameter can be one of following parameters:
*     @arg @ref   GPIO_SOURCE_EN
*     @arg @ref   GPIO_VBUS_DISCHARGE1
*     @arg @ref   GPIO_VBUS_DISCHARGE2
*     @arg @ref   GPIO_VCONN_EN1
*     @arg @ref   GPIO_VCONN_EN2
*     @arg @ref   GPIO_VCONN_DISCHARGE1
*     @arg @ref   GPIO_VCONN_DISCHARGE2
*     @arg @ref   GPIO_V_CTL2
*     @arg @ref   GPIO_V_CTL1
* @retval None
*/
static void PWR_GPIO_Off(GPIO_Id_TypeDef gpio)
{
  /* Update GPIO pin state */
  if ((gpio == GPIO_VCONN_EN1)   ||
      (gpio == GPIO_VCONN_EN2)   ||
      (gpio == GPIO_V_CTL1) ||
      (gpio == GPIO_V_CTL2))
{
  if (gpio == GPIO_V_CTL2)
  {
      GPIO_InitTypeDef  GPIO_InitStruct;

      PWR_GPIO_DeInit(GPIO_V_CTL2);

      GPIO_InitStruct.Pin   = GPIO_PIN[gpio];
      GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_OD;
      GPIO_InitStruct.Pull  = GPIO_NOPULL;
      GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
      HAL_GPIO_Init(GPIO_PORT[gpio], &GPIO_InitStruct);
      HAL_GPIO_WritePin(GPIO_PORT[gpio], GPIO_PIN[gpio], GPIO_PIN_RESET);
  }
  else
  {
      /* Set GPIO to inactive state (High level is HI-Z) */
      HAL_GPIO_WritePin(GPIO_PORT[gpio], GPIO_PIN[gpio], GPIO_PIN_SET);
    }
  }
  else
  {
    HAL_GPIO_WritePin(GPIO_PORT[gpio], GPIO_PIN[gpio], GPIO_PIN_RESET);
  }
}

/**
* @brief  Set ADC configuration.
* @retval 0 success else fail
*/
static uint8_t PWR_ADC_SetConfig(void)
{
  uint8_t ret = 0u;

  /* Initialize ADC (if not already used) */
  if (Context.ADCRefCount == 0u)
  {
    __HAL_ADC_RESET_HANDLE_STATE(&hadc1);

    /* Register ADC MSP callback functions */
    if (HAL_ADC_RegisterCallback(&hadc1, HAL_ADC_MSPINIT_CB_ID, PWR_ADC_MspInit) != HAL_OK) ret++;
    if (HAL_ADC_RegisterCallback(&hadc1, HAL_ADC_MSPDEINIT_CB_ID, PWR_ADC_MspDeInit) != HAL_OK) ret++;

    /* Configuration of hadc1 init structure: ADC parameters and regular group */
    hadc1.Instance = ADCx;

    hadc1.Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV4;
    hadc1.Init.Resolution            = ADC_RESOLUTION_12B;
    hadc1.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
    hadc1.Init.ScanConvMode          = ADC_SCAN_DIRECTION_FORWARD;
    hadc1.Init.EOCSelection          = ADC_EOC_SINGLE_CONV;
    hadc1.Init.LowPowerAutoWait      = DISABLE;
    hadc1.Init.LowPowerAutoPowerOff  = DISABLE;
    hadc1.Init.ContinuousConvMode    = ENABLE;
    hadc1.Init.DiscontinuousConvMode = DISABLE;
    hadc1.Init.ExternalTrigConv      = ADC_SOFTWARE_START;
    hadc1.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
    hadc1.Init.DMAContinuousRequests = ENABLE;
    hadc1.Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;
    hadc1.Init.SamplingTimeCommon1   = ADC_SAMPLETIME_39CYCLES_5;
    hadc1.Init.OversamplingMode      = DISABLE;

    if (HAL_ADC_Init(&hadc1) != HAL_OK)
    {
      ret++;
    }

    /* Register ADC conversion complete callback function */
    if (HAL_ADC_RegisterCallback(&hadc1, HAL_ADC_CONVERSION_COMPLETE_CB_ID, PWR_ADC_ConvCpltCallback) != HAL_OK) ret++;

