STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G0C1E-EV/stm32g0c1e_eval_pwr.c
        if (((ABS((int16_t)pwm_step_current-(int16_t)pwm_step_previous)) <= BSP_USBPD_PWR_DCDC_MIN_PWM_STEP)
             && ((ABS(((int32_t)vbus_measured - (int32_t)vbus_previous))) <= USBPD_PWR_DCDC_PRECISION)
             && ((ABS(vbus_error)) <= Precision))
        {
          nb_pll_loop++;
        }
        else
        {
          nb_pll_loop = 0u;
        }
      }
      while (nb_pll_loop < 1u);

      /* save the PWM value for the next settings */
      switch (VBusInmV)
      {
      case VBUS_VOLTAGE_0V_IN_MV:
        break;
      case VBUS_VOLTAGE_5V_IN_MV:
        {
        aPWMDutyCycleLUT[VBUS_5_V]  = duty_cycle;
        aPWMDutyCalibrated[VBUS_5_V] = 1u;
#if defined(_TRACE)
        sprintf(_str, "ca5V:%d", duty_cycle);
        USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
#endif
        break;
        }
      case VBUS_VOLTAGE_9V_IN_MV:
        {
        aPWMDutyCycleLUT[VBUS_9_V]  = duty_cycle;
        aPWMDutyCalibrated[VBUS_9_V] = 1u;
#if defined(_TRACE)
        sprintf(_str, "ca9V:%d", duty_cycle);
        USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
#endif
        break;
        }
      case VBUS_VOLTAGE_15V_IN_MV:
        {
        aPWMDutyCycleLUT[VBUS_15_V] = duty_cycle;
        aPWMDutyCalibrated[VBUS_15_V] = 1u;
#if defined(_TRACE)
        sprintf(_str, "ca15V:%d", duty_cycle);
        USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
#endif
        break;
        }
      case VBUS_VOLTAGE_18V_IN_MV:
        {
        aPWMDutyCycleLUT[VBUS_18_V] = duty_cycle;
        aPWMDutyCalibrated[VBUS_18_V] = 1u;
#if defined(_TRACE)
        sprintf(_str, "ca18V:%d", duty_cycle);
        USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
#endif
        break;
        }
      default:
        {
        aPWMDutyCycleLUT[VBUS_PPS_V] = duty_cycle;
#if defined(_TRACE)
        sprintf(_str, "calPPS:%d", duty_cycle);
        USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
#endif
        break;
        }
      }
    }
  }
  }
  else
  {
    _retr = BSP_ERROR_PERIPH_FAILURE;
  }

  return _retr;
}

/**
 * @brief  Start I/V sense on both Type-C ports.
 * @retval 0 success else fail
 */
static uint8_t PWR_StartVBusSensing(void)
{
  uint8_t ret = 0u;

  /* Start ADCx conversions */
  if (HAL_ADC_Start_DMA(&hadc1, (uint32_t *)aADCxConvertedValues, 4u) != HAL_OK)
  {
    ret++;
  }

  return ret;
}

/**
 * @brief  Stop I/V sense on both Type-C ports.
 * @retval 0 success else fail
 */
static uint8_t PWR_StopVBusSensing(void)
{
  uint8_t ret = 0u;

  /* Stop ADCx conversions */
  if (HAL_ADC_Stop_DMA(&hadc1) != HAL_OK)
  {
    ret++;
  }

  VBUSSensingCompleted = 0u;

  return ret;
}

/**
 * @brief  Pause I/V sense on both Type-C ports.
 * @retval 0 success else fail
 */
static uint8_t PWR_PauseVBusSensing(void)
{
  uint8_t ret = 0u;

  /* Stop on-going conversions */
  if (HAL_ADC_Stop_DMA(&hadc1) != HAL_OK)
  {
    ret++;
  }

  /* Reset Channel selection register */
  hadc1.Instance->CHSELR &= ~(ADC_CHSELR_SQ_ALL);

  VBUSSensingCompleted = 0u;

  return ret;
}

/**
 * @brief  Resume I/V sense on both Type-C ports.
 * @retval 0 success else fail
 */
static uint8_t PWR_ResumeVBusSensing(void)
{
  uint8_t  ret = 0u;
  uint32_t tickstart;

  /* Reset Channel selection register */
  hadc1.Instance->CHSELR &= ~(ADC_CHSELR_SQ_ALL);

  /* Configure the ADC channel used to sense VBUS1 voltage */
  ret += PWR_ADC_SetChannelConfig(ADC_VSENSE_1);

  /* Configure the ADC channel used to sense VBUS1 current */
  ret += PWR_ADC_SetChannelConfig(ADC_ISENSE_1);

  /* Configure the ADC channel used to sense VBUS2 voltage */
  ret += PWR_ADC_SetChannelConfig(ADC_VSENSE_2);

  /* Configure the ADC channel used to sense VBUS2 current */
  ret += PWR_ADC_SetChannelConfig(ADC_ISENSE_2);

  /* Start ADCx conversions */
  if (HAL_ADC_Start_DMA(&hadc1, (uint32_t *)aADCxConvertedValues, 4u) != HAL_OK)
  {
    ret++;
  }

  /* Wait until 1st DMA conversion is completed */
  tickstart = HAL_GetTick();

  while (VBUSSensingCompleted == 0u)
  {
    if((HAL_GetTick() - tickstart) >= VBUS_SENSING_RESUME_TIMEOUT)
    {
      /* Exit loop */
      break;
    }
  }


  return ret;
}

/**
  * @brief ADC MSP initialization
  * @param hadc ADC handle
  * @retval None
  */
static void PWR_ADC_MspInit(ADC_HandleTypeDef *hadc)
{
  /* Enable ADCx clock */
  ADCx_CLK_ENABLE();

  /* Enable clock of DMA associated to the peripheral */
  ADCx_DMA_CLK_ENABLE();

  /* Configure DMA parameters */
  hdma_adc1.Instance = ADCx_DMA;
  hdma_adc1.Init.Request             = DMA_REQUEST_ADC1;
  hdma_adc1.Init.Direction           = DMA_PERIPH_TO_MEMORY;
  hdma_adc1.Init.PeriphInc           = DMA_PINC_DISABLE;
  hdma_adc1.Init.MemInc              = DMA_MINC_ENABLE;
  hdma_adc1.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
  hdma_adc1.Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
  hdma_adc1.Init.Mode                = DMA_CIRCULAR;
  hdma_adc1.Init.Priority            = DMA_PRIORITY_HIGH;

  /* Initialize the DMA */
  (void)HAL_DMA_Init(&hdma_adc1);

  /* Associate the initialized DMA handle to the ADC handle */
  __HAL_LINKDMA(hadc, DMA_Handle, hdma_adc1);

  /* NVIC configuration for DMA interrupt (transfer completion or error) */
  HAL_NVIC_SetPriority(ADCx_DMA_IRQn, 1u, 0u);
  HAL_NVIC_EnableIRQ(ADCx_DMA_IRQn);

  /* NVIC configuration for ADCx interrupt */
  HAL_NVIC_SetPriority(ADC1_COMP_IRQn, 0u, 0u);
  HAL_NVIC_EnableIRQ(ADC1_COMP_IRQn);
}

/**
  * @brief ADC MSP de-initialization
  * @param hadc ADC handle
  * @retval None
  */
static void PWR_ADC_MspDeInit(ADC_HandleTypeDef *hadc)
{
  /* Reset ADC peripheral */
  ADCx_FORCE_RESET();
  ADCx_RELEASE_RESET();

  /* Disable ADCx clock */
  ADCx_CLK_DISABLE();

  /* Disable the NVIC configuration for ADCx interrupt */
  HAL_NVIC_DisableIRQ(ADC1_COMP_IRQn);

  /* Disable NVIC configuration for DMA interrupt */
  HAL_NVIC_DisableIRQ(ADCx_DMA_IRQn);

  /* De-Initialize the DMA */
  (void)HAL_DMA_DeInit(hadc->DMA_Handle);
}

/**
  * @brief  Analog watchdog 1 callback
  * @param hadc ADC handle
  * @retval None
  */
void HAL_ADC_LevelOutOfWindowCallback(ADC_HandleTypeDef* hadc)
{
  ADC_AnalogWDGConfTypeDef adc_awd_config = {0u};

  if (Context.PortInfo[USBPD_PWR_TYPE_C_PORT_1].pfnVBUSDetectCallback != NULL)
  {
    if (Context.PortInfo[USBPD_PWR_TYPE_C_PORT_1].VBUSConnectionStatus == VBUS_NOT_CONNECTED)
    {
      /* PORT1: VBUS_NOT_CONNECTED to VBUS_CONNECTED transition */
      Context.PortInfo[USBPD_PWR_TYPE_C_PORT_1].VBUSConnectionStatus = VBUS_CONNECTED;
      adc_awd_config.HighThreshold = 0xFFF;
      adc_awd_config.LowThreshold  = PWR_ConvertVoltageToThreshold(Context.PortInfo[USBPD_PWR_TYPE_C_PORT_1].VBUSDisconnectionThreshold);
    }
    else
    {
      /* PORT1: VBUS_CONNECTED to VBUS_NOT_CONNECTED transition */
      Context.PortInfo[USBPD_PWR_TYPE_C_PORT_1].VBUSConnectionStatus = VBUS_NOT_CONNECTED;
      adc_awd_config.HighThreshold = PWR_ConvertVoltageToThreshold(VBUS_CONNECTION_THRESHOLD);
      adc_awd_config.LowThreshold  = 0u;
    }

